/***

Generate a multiplication table for number 9

 */


let number = 9;

for(let i = 1; i<= 10; i++){
    console.log(`${number} x ${i} = ${number * i}`);
}

//   **backtick ()** ব্যবহার করছি। এটি হচ্ছে **template string**, যাতে ${}` এর ভেতরে ভেরিয়েবল রাখা যায়।

// এটি number ভেরিয়েবলের মান (যেমন ৯) স্ট্রিংয়ের মধ্যে বসায়।

// এটি কেবল "x", গুন (×) বোঝাতে ব্যবহার করা হয়েছে। যেমন: ৯ x ১

// এখানে লুপের ভেরিয়েবল i এর মান বসানো হয় (যেমন: ১, ২, ৩ ...)

// শুধু = চিহ্ন — এটি ফলাফল দেখাতে ব্যবহৃত।


// এটি number ও i এর গুণফল হিসাব করে (যেমন ৯ * ৩ = ২৭) এবং সেটি দেখায়।