
// Subtask-1:

// Find all the odd numbers from 61 to 100.

 for(let i = 61; i<= 100; i++){
    if(i % 2 !==0){
        console.log(i);
    }
 }

// -----------------------------------------------------------------------------
 let oddNumbers = []; //oddNumbers নামে একটি খালি অ্যারে তৈরি করা হলো। সব বিজোড় সংখ্যা এখানে জমা করব।

for (let i = 61; i <= 100; i++) //এটি একটি for লুপ। এটি i = 61 থেকে শুরু হবে এবং i <= 100 পর্যন্ত চলবে। প্রতিবার i এর মান ১ করে বাড়বে।
 {
  if (i % 2 !== 0)//এই শর্তটি চেক করে i সংখ্যাটি বিজোড় কি না। যদি ২ দিয়ে ভাগ করলে ভাগশেষ (remainder) ০ না হয়, তাহলে সংখ্যাটি বিজোড়।
     {
    console.log(i);          //প্রতিটি বিজোড় সংখ্যা কনসোলে (স্ক্রিনে) দেখানো হবে। 
    oddNumbers.push(i);      // বর্তমান বিজোড় সংখ্যাটিকে oddNumbers অ্যারেতে যোগ করা হলো।
  }
}

console.log("All odd numbers from 61 to 100:");//সব বিজোড় সংখ্যার তালিকা দেখানোর আগে একটি টাইটেল/বার্তা প্রিন্ট করা হলো।
console.log(oddNumbers);     // সব বিজোড় সংখ্যা নিয়ে তৈরি oddNumbers অ্যারেটি প্রিন্ট করে দেখানো হলো।
// -------------------------------------------------------------------------------------------------


// Subtask-2:

// Find all the even numbers from 78 to 98.

for(let i = 78; i<= 98; i++){
    if(i % 2 == 0){
        console.log(i);
    }
}
// --------------------------------------------------------------------------

let evenNumbers = [];

for(let i =78; i<= 98; i++){
    if(i % 2 == 0){
        console.log(i);
        evenNumbers.push(i);
    }
}
console.log("All Even Number From 78 To 98:");
console.log(evenNumbers);
//----------------------------------------------------------------//