
// Subtask-1:

// Display sum of all the odd numbers from 91 to 129.


let oddNumbers = []; //oddNumbers = [] → বিজোড় সংখ্যা রাখার জন্য খালি অ্যারে
let sum = 0;//sum = 0 → যোগফল রাখার জন্য ভেরিয়েবল, শুরুতে ০ ---যোগফল গণনার জন্য একটি কাউন্টার ০ দিয়ে শুরু করা হলো

for(let i = 91; i<= 129; i++){
    if(i % 2 !==0)// যদি সংখ্যাটি 2 দিয়ে ভাগ করলে ভাগশেষ ১ থাকে, তাহলে এটি বিজোড় সংখ্যা।
        {
        oddNumbers.push(i);//push() মেথড দিয়ে বিজোড় সংখ্যাটি অ্যারের শেষে যোগ করা হয়
        sum +=i;//sum += i এর মানে sum = sum + i _____পূর্বের যোগফলের সাথে নতুন বিজোড় সংখ্যাটি যোগ করা হয়
        console.log(sum);//প্রতিটি বিজোড় সংখ্যা যোগ করার পর বর্তমান যোগফল প্রিন্ট করা হয়
    }
}

console.log("odd numbers from 91 to 129: ");
console.log(oddNumbers);

console.log("sum of all odd numbers from 91 to 129: ");
console.log(sum);
//প্রথমে বার্তা দিয়ে সব বিজোড় সংখ্যার তালিকা দেখানো হয়-------তারপর বার্তা দিয়ে চূড়ান্ত যোগফল দেখানো হয়
//প্রথমে সব বিজোড় সংখ্যার তালিকা দেখানো হবে-----তারপর সব বিজোড় সংখ্যার মোট যোগফল দেখানো হবে

// --------------------------------------------------//-----------------------------------------------




